Repository: slow-spec85/SimpleGit11
Catalog: SimpleGit11/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# BranchCreateStartPointAutoSuggestBox.Header
source: Start point
ru_ru: Начальная точка

# BranchCreateStartPointAutoSuggestBox.PlaceholderText
source: Commit hash, branch name, or tag name
ru_ru: Хэш коммита, имя ветки или имя тега

# BranchCreateStartPointAutoSuggestBox.AutomationProperties.Name
source: Branch start point
ru_ru: Начальная точка ветки

# BranchCreateLoadingRevisionsTextBlock.Text
source: Loading start points…
ru_ru: Загрузка начальных точек…

# BranchDeleteTitle
source: Deleting
ru_ru: Удаление

# BranchDeletePrimaryButtonText
source: Delete
ru_ru: Удалить

# BranchDeleteMessage
source: Delete branch '{0}'?
ru_ru: Удалить ветку '{0}'?

# BranchForceDeleteTitle
source: Force delete branch
ru_ru: Принудительное удаление ветки

# BranchForceDeletePrimaryButtonText
source: Force delete
ru_ru: Удалить принудительно

# BranchForceDeleteMessage
source: Branch '{0}' is not fully merged. Force delete it? Commits that are only reachable from this branch may become hard to restore.
ru_ru: Ветка '{0}' не полностью слита. Удалить ее принудительно? Коммиты, доступные только из этой ветки, будет сложнее восстановить.

# CreateBranchSplitButtonTextBlock.Text
source: Branch
ru_ru: Ветка

# RenameBranchMenuFlyoutItem.Text
source: Rename
ru_ru: Переименовать

# DeleteBranchMenuFlyoutItem.Text
source: Delete
ru_ru: Удалить

# SquashMergeBranchMenuFlyoutItem.Text
source: Squash merge
ru_ru: Слить только изменения

# RebaseBranchMenuFlyoutItem.Text
source: Rebase
ru_ru: Перебазировать текущую ветку

# AbortMergeAppBarButton.Label
source: Abort merge
ru_ru: Отменить слияние

# ContinueOperationSplitButtonTextBlock.Text
source: Continue
ru_ru: Продолжить

# ContinueOperationSplitButton.ToolTipService.ToolTip
source: Continue the current Git operation
ru_ru: Продолжить текущую операцию Git

# SkipOperationMenuFlyoutItem.Text
source: Skip current commit
ru_ru: Пропустить текущий коммит

# AbortOperationMenuFlyoutItem.Text
source: Abort operation
ru_ru: Отменить операцию

# MergeCommitDialogTitle
source: Complete merge
ru_ru: Завершение слияния

# RemoteBranchCheckoutSucceeded
source: Checked out remote branch '{0}' as local branch '{1}'.
ru_ru: Удаленная ветка '{0}' переключена как локальная '{1}'.

# MergeBranchDialogTitle
source: Merge branch?
ru_ru: Выполнить merge?

# MergeBranchDialogMessage
source: Merge '{0}' into the current branch? Conflicts may need to be resolved before continuing.
ru_ru: Влить '{0}' в текущую ветку? При конфликтах потребуется ручное разрешение.

# SquashMergeBranchDialogTitle
source: Squash merge branch?
ru_ru: Выполнить squash merge?

# SquashMergeBranchDialogMessage
source: Squash merge '{0}' into the current branch? Changes will be staged for a later commit.
ru_ru: Влить '{0}' в текущую ветку через squash? Изменения будут подготовлены для отдельного коммита.

# RebaseBranchDialogTitle
source: Rebase current branch?
ru_ru: Выполнить rebase?

# RebaseBranchDialogMessage
source: Rebase the current branch onto '{0}'? This rewrites local commit history.
ru_ru: Перебазировать текущую ветку на '{0}'? Это переписывает локальную историю коммитов.

# AbortMergeDialogTitle
source: Abort merge?
ru_ru: Отменить merge?

# AbortMergeDialogMessage
source: Abort the in-progress merge and return the working tree to the pre-merge state?
ru_ru: Отменить текущий merge и вернуть рабочее дерево в состояние до merge?

# AbortMergeDialogPrimaryButton
source: Abort merge
ru_ru: Отменить merge

# SkipOperationDialogTitle
source: Skip current commit?
ru_ru: Пропустить текущий коммит?

# SkipOperationDialogMessage
source: Skip the current commit and continue the operation? Its changes will not be included.
ru_ru: Пропустить текущий коммит и продолжить операцию? Его изменения не войдут в историю.

# SkipOperationDialogPrimaryButton
source: Skip commit
ru_ru: Пропустить коммит

# MergeBranchSucceeded
source: Merged '{0}' into the current branch.
ru_ru: Ветка '{0}' влита в текущую ветку.

# SquashMergeBranchSucceeded
source: Squash merged '{0}'. Review and commit the staged changes.
ru_ru: Выполнен squash merge '{0}'. Проверьте и закоммитьте подготовленные изменения.

# RebaseBranchSucceeded
source: Rebased the current branch onto '{0}'.
ru_ru: Текущая ветка перебазирована на '{0}'.

# RebaseBranchAlreadyUpToDate
source: The current branch is already based on '{0}'. No commits were changed.
ru_ru: Текущая ветка уже основана на '{0}'. Коммиты не изменены.

# AbortMergeSucceeded
source: Merge aborted.
ru_ru: Merge отменен.

# AbortOperationDialogTitle
source: Abort operation?
ru_ru: Отменить операцию?

# AbortOperationDialogMessage
source: Abort the current Git operation and return to its previous state?
ru_ru: Отменить текущую операцию Git и вернуть репозиторий в предыдущее состояние?

# AbortOperationDialogPrimaryButton
source: Abort operation
ru_ru: Отменить операцию

# ContinueOperationSucceeded
source: The operation continued.
ru_ru: Операция продолжена.

# ResolveConflictsBeforeContinueOperation
source: Resolve and stage all conflicts before continuing the operation.
ru_ru: Перед продолжением операции разрешите и проиндексируйте все конфликты.

# SkipOperationSucceeded
source: The current commit was skipped.
ru_ru: Текущий коммит пропущен.

# AbortOperationSucceeded
source: The operation was aborted.
ru_ru: Операция отменена.

# GitOperationCommandFailed
source: The Git operation could not be completed.
ru_ru: Не удалось выполнить операцию Git.

# SynchronizationTitleTextBlock.Text
source: Synchronization
ru_ru: Синхронизация

# SynchronizationDescriptionTextBlock.Text
source: Fetch, pull, push, and inspect remote repositories.
ru_ru: Проверка, вытягивание, отправка изменений в удаленный репозиторий.

# RefreshSynchronizationAppBarButton.Label
source: Refresh
ru_ru: Обновить

# AddRemoteButton.Content
source: Add
ru_ru: Добавить

# PullAppBarButton.Label
source: Pull
ru_ru: Вытянуть

# PushSplitButtonTextBlock.Text
source: Push
ru_ru: Отправить

# PushSplitButton.AutomationProperties.Name
source: Push all changes
ru_ru: Отправить все изменения

# PushSplitButton.ToolTipService.ToolTip
source: Push all local changes. Open the menu for atomic push.
ru_ru: Отправить все локальные изменения. Откройте меню для атомарной отправки.

# AtomicPushMenuFlyoutItem.Text
source: Push atomically
ru_ru: Отправить атомарно

# AtomicPushMenuFlyoutItem.AutomationProperties.HelpText
source: Either all references for each remote repository are updated, or none are.
ru_ru: Все ссылки каждого удалённого репозитория обновятся вместе либо не изменятся.

# RefreshSynchronizationTooltip.Content
source: Fetch the latest state of the remote repository
ru_ru: Получить актуальное состояние удаленного репозитория

# PullSynchronizationTooltip.Content
source: Pull incoming changes into the current branch
ru_ru: Вытянуть входящие изменения в текущую ветку

# CancelSynchronizationOperationButton.Content
source: Cancel
ru_ru: Отменить

# CancelSynchronizationOperationButton.AutomationProperties.Name
source: Cancel remote operation
ru_ru: Отменить удаленную операцию

# SynchronizationOperationCanceled
source: The remote operation was canceled.
ru_ru: Удаленная операция отменена.

# OpenRepositoryBeforeSynchronization
source: Open a repository before synchronizing changes.
ru_ru: Откройте репозиторий перед управлением удаленными ветками.

# GitRemoteCommandFailed
source: Remote operation failed.
ru_ru: Операция с удалённым репозиторием завершилась с ошибкой.

# RefreshingSynchronizationProgress
source: Refreshing synchronization status...
ru_ru: Обновление удаленного репозитория...

# PullingProgress
source: Pulling current branch...
ru_ru: Выполняется вытягивание изменений текущей ветки...

# PullSucceeded
source: Pull completed.
ru_ru: Вытягивание изменений завершено.

# RemoteAuthenticationFailed
source: Authentication failed. Check your credentials or Git credential manager.
ru_ru: Ошибка авторизации. Проверьте учетные данные или Git Credential Manager.

# RemoteOperationConflicts
source: Git reported conflicts. Resolve conflicts before continuing.
ru_ru: Git сообщил о конфликтах. Разрешите конфликты перед продолжением.

# RemoteOperationNonFastForward
source: Push was rejected because the remote has commits you do not have. Fetch or pull first.
ru_ru: Отправка отклонена: в удаленном репозитории есть коммиты, которых нет локально. Выполните проверку или вытягивание.

# RemoteAtomicPushNotSupported
source: The remote repository does not support atomic push. Use the regular Push command.
ru_ru: Удалённый репозиторий не поддерживает атомарную отправку. Используйте обычную команду «Отправить».

# RepositorySettingsTitleTextBlock.Text
source: Current repository settings
ru_ru: Настройки текущего репозитория

# RepositoryDefaultsTitleTextBlock.Text
source: Git settings
ru_ru: Параметры Git

# InitialBranchNameSettingsCardHeaderTextBlock.Text
source: Default initial branch
ru_ru: Начальная ветка по умолчанию

# RepositoryUserNameSettingsCardHeaderTextBlock.Text
source: User name
ru_ru: Имя пользователя

# RepositoryUserNameSettingsTextBox.PlaceholderText
source: James Smith
ru_ru: Иван Иванов

# RepositoryEmailSettingsCardHeaderTextBlock.Text
source: Email
ru_ru: Почта

# SaveRepositorySettingsButton.Content
source: Save
ru_ru: Сохранить

# SaveGitSettingsCardHeaderTextBlock.Text
source: Save Git settings
ru_ru: Сохранить параметры Git

# RepositorySettingsSaved
source: Git settings saved.
ru_ru: Параметры Git сохранены.

# GitConfigReadFailed
source: Could not read Git settings.
ru_ru: Не удалось прочитать параметры Git.

# GitConfigSaveFailed
source: Could not save Git settings.
ru_ru: Не удалось сохранить параметры Git.

# CredentialHelperSetupDialogTitle
source: Git Credential Manager required
ru_ru: Требуется Git Credential Manager

# CredentialHelperSetupDialogMessage
source: SimpleGit11 remote features work only when Git credential.helper is configured as manager. Apply this global Git setting to use clone, fetch, pull, and push?
ru_ru: Удаленные функции SimpleGit11 работают только когда Git credential.helper настроен как manager. Применить эту глобальную настройку Git для clone, fetch, pull и push?

# CredentialHelperSetupDialogPrimaryButton
source: Apply
ru_ru: Применить

# GlobalRepositorySettingsTitleTextBlock.Text
source: Global Git settings
ru_ru: Глобальные настройки Git

# CommitDialogPrimaryButton
source: Commit
ru_ru: Ок

# CommitSplitButtonTextBlock.Text
source: Commit
ru_ru: Коммит

# AmendCommitMenuFlyoutItem.Text
source: Amend
ru_ru: Исправить

# AmendMessageCheckBox.Content
source: Edit Message
ru_ru: Редактировать сообщение

# AmendDialogTitle
source: Amending a previous commit
ru_ru: Исправление предыдущего коммита

# DiscardSelectedSplitButtonTextBlock.Text
source: Discard
ru_ru: Отменить

# RevertCommitAppBarButton.Label
source: Revert
ru_ru: Отменить

# RevertCommitMenuFlyoutItem.Text
source: Revert
ru_ru: Отменить

# ResetSplitButtonTextBlock.Text
source: Reset
ru_ru: Сброс

# ResetCommitSplitMenuFlyoutItem.Text
source: Reset
ru_ru: Сброс

# ResetSoftMenuFlyoutItem.Text
source: Soft
ru_ru: Мягкий

# ResetMixedMenuFlyoutItem.Text
source: Mixed
ru_ru: Смешанный

# ResetHardMenuFlyoutItem.Text
source: Hard
ru_ru: Жесткий

# ConfirmationDialogCancelButton
source: Cancel
ru_ru: Отмена

# DiscardFileDialogTitle
source: Discard file changes?
ru_ru: Отменить изменения файла?

# DiscardFileDialogMessage
source: This will permanently discard local changes in '{0}'. This action cannot be undone from SimpleGit11.
ru_ru: Локальные изменения в файле '{0}' будут безвозвратно отменены. Это действие нельзя откатить из SimpleGit11.

# DiscardFileDialogPrimaryButton
source: Discard
ru_ru: Выполнить

# DiscardSelectedFilesDialogTitle
source: Discard selected file changes?
ru_ru: Отменить изменения выбранных файлов?

# DiscardSelectedFilesDialogMessage
source: This will permanently discard local changes in {0} selected files. This action cannot be undone from SimpleGit11.
ru_ru: Будут безвозвратно отменены локальные изменения в выбранных файлах. Количество файлов: {0}. Это действие нельзя отменить из SimpleGit11.

# DiscardSelectedFilesDialogPrimaryButton
source: Discard selected
ru_ru: Отменить выбранные

# CleanUntrackedDialogTitle
source: Clean untracked files?
ru_ru: Удалить untracked-файлы?

# CleanUntrackedDialogMessage
source: This will permanently delete all untracked files and folders in the repository.
ru_ru: Все untracked-файлы и папки в репозитории будут безвозвратно удалены.

# CleanUntrackedDialogPrimaryButton
source: Clean
ru_ru: Удалить

# ApplyStashDialogTitle
source: Apply stash?
ru_ru: Применить спрятанные изменения?

# ApplyStashDialogMessage
source: Apply '{0}' to the working tree? Existing local changes can conflict.
ru_ru: Применить '{0}' к рабочему дереву? Возможны конфликты с локальными изменениями.

# ApplyStashDialogPrimaryButton
source: Apply
ru_ru: Применить

# PopStashDialogTitle
source: Pop stash?
ru_ru: Вытащить?

# PopStashDialogMessage
source: Apply and remove '{0}' from the stash list? Existing local changes can conflict.
ru_ru: Достать и применить '{0}'? Возможны конфликты с локальными изменениями.

# PopStashDialogPrimaryButton
source: Pop
ru_ru: Ок

# DropStashDialogTitle
source: Drop stash?
ru_ru: Удалить заначку?

# DropStashDialogMessage
source: Permanently remove '{0}' from the stash list?
ru_ru: Безвозвратно удалить '{0}' из заначек?

# DropStashDialogPrimaryButton
source: Drop
ru_ru: Удалить

# DropAllStashesDialogTitle
source: Drop all stashes?
ru_ru: Удалить все заначки?

# DropAllStashesDialogMessage
source: Permanently remove all stashes? Stashes to remove: {0}. This action cannot be undone.
ru_ru: Безвозвратно удалить все заначки? Количество заначек: {0}. Это действие нельзя отменить.

# DropAllStashesDialogPrimaryButton
source: Drop all
ru_ru: Удалить все

# RevertCommitDialogTitle
source: Revert commit?
ru_ru: Отменить коммит?

# RevertCommitDialogMessage
source: Create a new commit that reverts {0}: {1}?
ru_ru: Создать новый коммит, который отменяет {0}: {1}?

# RevertCommitDialogPrimaryButton
source: Revert
ru_ru: Да

# ResetSoftDialogTitle
source: Soft reset?
ru_ru: Мягкий сброс?

# ResetSoftDialogMessage
source: Move HEAD to {0}: {1}, keeping changes staged?
ru_ru: Переместить HEAD на {0}: {1}, сохранив изменения staged?

# ResetSoftDialogPrimaryButton
source: Reset soft
ru_ru: Мягкий сброс

# ResetMixedDialogTitle
source: Mixed reset?
ru_ru: Смешанный сброс?

# ResetMixedDialogMessage
source: Move HEAD to {0}: {1}, keeping changes in the working tree but unstaged?
ru_ru: Переместить HEAD на {0}: {1}, сохранив изменения в working tree как unstaged?

# ResetMixedDialogPrimaryButton
source: Reset mixed
ru_ru: Смешанный сброс

# ResetHardDialogTitle
source: Hard reset?
ru_ru: Жесткий сброс?

# ResetHardDialogMessage
source: Move HEAD to {0}: {1} and permanently discard local changes?
ru_ru: Переместить HEAD на {0}: {1} и безвозвратно удалить локальные изменения?

# ResetHardDialogPrimaryButton
source: Reset hard
ru_ru: Жесткий сброс

# DiscardFileSucceeded
source: Discarded changes in '{0}'.
ru_ru: Изменения в '{0}' отменены.

# DiscardSelectedFilesSucceeded
source: Discarded changes in {0} selected files.
ru_ru: Изменения в выбранных файлах отменены. Количество файлов: {0}.

# CleanUntrackedSucceeded
source: Cleaned untracked files.
ru_ru: Untracked-файлы удалены.

# CreateStashSucceeded
source: Stash created.
ru_ru: Заначка создана.

# ApplyStashSucceeded
source: Applied {0}.
ru_ru: Заначка {0} применена.

# PopStashSucceeded
source: Popped {0}.
ru_ru: Заначка {0} вытащена.

# DropStashSucceeded
source: Dropped {0}.
ru_ru: Заначка {0} удалена.

# DropAllStashesSucceeded
source: Dropped all stashes.
ru_ru: Все заначки удалены.

# RevertCommitSucceeded
source: Reverted {0}.
ru_ru: Выполнен revert для {0}.

# ResetSucceeded
source: Completed {0} reset to {1}.
ru_ru: Выполнен {0} reset на {1}.

# SelectStashBeforeOperation
source: Select a stash before running this operation.
ru_ru: Выберите заначку перед выполнением операции.

# GitDangerousOperationFailed
source: Git operation failed.
ru_ru: Git-операция завершилась с ошибкой.

# StageSplitButtonTextBlock.Text
source: Stage
ru_ru: Подготовка

# StageMenuFlyoutItem.Text
source: Stage selected
ru_ru: Подготовить выбранное

# UnstageSelectedMenuFlyoutItem.Text
source: Unstage selected
ru_ru: Отменить выбранное

# UnstageAllMenuFlyoutItem.Text
source: Unstage all
ru_ru: Отменить все

# OpenStashDialogAppBarButton.Label
source: Stash
ru_ru: Заначки

# DiscardAllUnstagedMenuFlyoutItem.Text
source: Discard unstaged
ru_ru: Отменить всё

# DiscardAllUnstagedDialogTitle
source: Discard all unstaged changes?
ru_ru: Отменить все unstaged изменения?

# DiscardAllUnstagedDialogMessage
source: This will discard all unstaged file changes and remove untracked files. Staged changes will stay staged.
ru_ru: Будут отменены все unstaged изменения файлов и удалены untracked файлы. Staged изменения останутся подготовленными.

# DiscardAllUnstagedDialogPrimaryButton
source: Discard unstaged
ru_ru: Отменить всё

# DiscardAllUnstagedSucceeded
source: Discarded all unstaged changes.
ru_ru: Все unstaged изменения отменены.

# StashDialogTitleTextBlock.Text
source: Stash
ru_ru: Заначки

# CreateStashAppBarButton.Label
source: Stash
ru_ru: Спрятать

# ApplyStashAppBarButton.Label
source: Apply
ru_ru: Применить

# PopStashAppBarButton.Label
source: Pop
ru_ru: Вытащить

# DropStashSplitButtonTextBlock.Text
source: Drop
ru_ru: Удалить

# DropAllStashesMenuFlyoutItem.Text
source: Drop all
ru_ru: Удалить все

# StashListDescriptionTextBlock.Text
source: Hidden changes
ru_ru: Спрятанные изменения

# BranchDeleteFailed
source: Deleting branch '{0}' failed
ru_ru: Удаление ветки '{0}' завершилось с ошибкой

# RemoteNotFound
source: Remote {0} not found
ru_ru: Удаленный репозиторий {0} не найден

# BranchDeleteProgressMessage
source: Deleting branch '{0}'
ru_ru: Удаление ветки '{0}'

# BranchCheckoutProgressMessage
source: Checking out to branch '{0}'
ru_ru: Переключение на ветку '{0}'

# BranchCreateProgressMessage
source: Creating branch '{0}'
ru_ru: Создание ветки '{0}'

# OrphanBranchCreateProgressMessage
source: Creating orphan branch '{0}' with an initial empty commit
ru_ru: Создание orphan-ветки '{0}' с начальным пустым коммитом

# OrphanBranchCheckoutProgressMessage
source: Creating and switching to orphan branch '{0}'
ru_ru: Создание и переключение на orphan-ветку '{0}'

# OrphanBranchInitialCommitMessage
source: Initial empty commit
ru_ru: Начальный пустой коммит

# OrphanBranchSnapshotCreateProgressMessage
source: Creating orphan branch '{0}' from the selected commit's file snapshot
ru_ru: Создание orphan-ветки '{0}' из снимка файлов выбранного коммита

# OrphanBranchSnapshotCheckoutProgressMessage
source: Creating and switching to orphan branch '{0}' from the selected commit's file snapshot
ru_ru: Создание orphan-ветки '{0}' из снимка файлов выбранного коммита и переключение на неё

# OrphanBranchSnapshotCommitMessage
source: Initial snapshot
ru_ru: Начальный снимок

# BranchRenameProgressMessage
source: Renaming the branch '{0}' to '{1}'
ru_ru: Переименование ветки '{0}' в '{1}'

# MergeBranchProgressMessage
source: Merging '{0}' with the current branch
ru_ru: Слияние '{0}' с текущей веткой

# RebaseBranchProgressMessage
source: The current branch is being rebased to '{0}'
ru_ru: Выполняется перебазирование текущей ветки на '{0}'

# AbortMergeProgressMessage
source: Merge cancellation is in progress
ru_ru: Выполняется отмена merge

# SyntaxHighlightingTooltip.Content
source: Syntax highlighting
ru_ru: Подсветка синтаксиса

# CopyRepositoryPathMenuFlyoutItem.Text
source: Copy path
ru_ru: Копировать путь

# OpenFoundRepositoryMenuFlyoutItem.Text
source: Open
ru_ru: Открыть

# CopyFoundRepositoryPathMenuFlyoutItem.Text
source: Copy path
ru_ru: Копировать путь

# CopyFoundRepositoryNameMenuFlyoutItem.Text
source: Copy name
ru_ru: Копировать название

# OpenRepositoryAppBarButton.Label
source: Open
ru_ru: Открыть

# CreateRepositoryAppBarButton.Label
source: Create
ru_ru: Создать

# CloneRepositoryAppBarButton.Label
source: Clone
ru_ru: Клонировать

# CloneRepositoryUrlTextBox.Header
source: Clone URL
ru_ru: URL для клонирования

# CloneRepositoryFlyoutButton.Content
source: Clone
ru_ru: Клонировать

# RefreshRepositoryAppBarButton.Label
source: Refresh
ru_ru: Обновить

# CloseRepositoryAppBarButton.Label
source: Close
ru_ru: Закрыть

# RepositoryStatusSectionTitleTextBlock.Text
source: Current state
ru_ru: Текущее состояние

# RepositoryStatusSectionDescriptionTextBlock.Text
source: Repository status, last commit, and upstream
ru_ru: Состояние репозитория, последний коммит и upstream

# WorkingTreeCardTitleTextBlock.Text
source: Working tree
ru_ru: Рабочее дерево

# StagedCountLabelTextBlock.Text
source: Staged
ru_ru: В индексе

# UnstagedCountLabelTextBlock.Text
source: Unstaged
ru_ru: Не в индексе

# ConflictCountLabelTextBlock.Text
source: Conflicts
ru_ru: Конфликты

# SynchronizationCardTitleTextBlock.Text
source: Synchronization
ru_ru: Синхронизация

# AheadCountLabelTextBlock.Text
source: Ahead
ru_ru: Впереди

# BehindCountLabelTextBlock.Text
source: Behind
ru_ru: Позади

# RepositorySearchTitleTextBlock.Text
source: Other repositories
ru_ru: Другие репозитории

# RepositorySearchDescriptionTextBlock.Text
source: Repositories found in the selected folder
ru_ru: Репозитории, найденные в выбранной папке

# FoundRepositoryFilterTextBox.PlaceholderText
source: Find
ru_ru: Найти

# BrowseRepositorySearchStartPathAppBarButton.Label
source: Select
ru_ru: Выбрать

# BrowseRepositorySearchStartPathAppBarButton.ToolTipService.ToolTip
source: Choose start folder
ru_ru: Выбрать начальную папку

# BrowseRepositorySearchStartPathAppBarButton.AutomationProperties.Name
source: Choose start folder
ru_ru: Выбрать начальную папку

# RefreshRepositorySearchButton.Content
source: Refresh
ru_ru: Обновить

# NoFoundRepositoriesInfoBar.Title
source: No repositories
ru_ru: Нет репозиториев

# NoFoundRepositoriesInfoBar.Message
source: No repositories are saved or found for the current search path.
ru_ru: Для текущего пути нет сохраненных или найденных репозиториев.

# NoFilteredFoundRepositoriesInfoBar.Title
source: No matching repositories
ru_ru: Нет подходящих репозиториев

# NoFilteredFoundRepositoriesInfoBar.Message
source: Try a different filter.
ru_ru: Попробуйте изменить фильтр.

# SearchingRepositoriesProgress
source: Searching repositories...
ru_ru: Выполняется поиск репозиториев...

# CreatingRepositoryProgress
source: Creating repository...
ru_ru: Создается репозиторий...

# RepositoryCreated
source: Repository '{0}' created.
ru_ru: Репозиторий '{0}' создан.

# GitInitCommandFailed
source: Could not create the repository.
ru_ru: Не удалось создать репозиторий.

# CloningRepositoryProgress
source: Cloning repository...
ru_ru: Выполняется клонирование репозитория...

# RepositoryCloned
source: Repository '{0}' cloned.
ru_ru: Репозиторий '{0}' клонирован.

# GitCloneCommandFailed
source: Could not clone the repository.
ru_ru: Не удалось клонировать репозиторий.

# RepositorySearchFolderNotFound
source: The repository search start folder was not found.
ru_ru: Начальная папка поиска репозиториев не найдена.

# RepositoryStateConflicts
source: {0} conflict(s)
ru_ru: Конфликты: {0}

# RepositoryStateClean
source: Clean working tree
ru_ru: Рабочее дерево чистое

# RepositoryStateChanged
source: {0} staged, {1} unstaged
ru_ru: В индексе: {0}, не в индексе: {1}

source: No commits yet
ru_ru: Commit'ов пока нет

source: No upstream configured
ru_ru: Upstream не настроен

# RepositoryRemoteBranchSummary
source: {0} - ahead {1}, behind {2}
ru_ru: {0} - впереди {1}, позади {2}

# RepositoryRemoteBranchNotPublished
source: {0} - not published
ru_ru: {0} - не опубликована
